Section 10: Regular Expressions/Section 10.org
* Regex Character Classes and the findall() Method

In this lesson, we'll talk about the findall() method with regular expressions.

#+begin_src python :results output :exports both

import re

resume="""
JESSE KENDALL
123 Elm Street, Fall River, MA 02723, Cell: 508-555-5555, Home: 508-555-1234 twemel@charter.net



SUMMARY OF QUALIFICATIONS
Dedicated cell phone sales professional with demonstrated success in retail management, product presentation, and customer service. Proven ability to assess client needs; establish rapport, build trust, and close deals. Meet and exceed sales objectives and challenging goals. Proficient in Microsoft Office (Word, Excel, PowerPoint, Access), and H/O billing systems.

SALES SUCCESS
RETAIL STORE SALES MANAGER, 20xx – 20xx
ABC CELLULAR, Fall River, MA
Recruited, hired, trained, developed, and directed retail sales teams for two retail ABC Wireless dealer stores. Oversaw client relations, new account development, and customer service. Supervised administrative functions, inventory, cash flow, merchandising, and operations. Conducted ongoing staff development and personal growth planning for employees.

Implemented a sales-tracking spreadsheet to replace a manual form writing process to increase efficiency.
Developed innovative and effective marketing programs; exceeded store sales quotas.
Successfully managed one of the highest-producing ABC Wireless dealer locations in the San Diego market.
Received several “Sales Manager of the Month” Awards.
Created a team spirit within the stores that resulted in increased sales, long-term employees, and customer satisfaction.
CELL PHONE SALES REPRESENTATIVE, 20xx – 20xx
BCD CELL PHONE HUT, Fall River, MA
Partnered with a high-performing sales staff to provided quality customer service. Served as a customer advocate; interfaced with the clients’ designated program administrators to provide product and service solutions and meet individual customer needs. Assisted customers with billing and expense management, post sale customer education on wireless service and equipment, issue resolution, and technical troubleshooting.

Effectively delivered post-sale care services, exceeding clients’ expectations in a cost-effective manner.
Obtained significant business by delivering presale presentations to demonstrate new phone features.
CUSTOMER SERVICE REPRESENTATIVE, 20xx – 20xx
CDE CELLULAR SERVICES, Fall River, MA
Responded to billing inquiries, assisted in technical troubleshooting, and performed rate plan analysis. Provided friendly and professional customer service while answering over 90 inbound calls per day.

Chosen to facilitate training in an outsourced call center.
EDUCATION
Bachelor of Arts in Communication (Major: Advertising), 20xx
XYZ UNIVERSITY, Milwaukee, WI

REFERENCES
Excellent references provided upon request.
"""


phoneRegex=re.compile(r"\d{3}-\d{3}-\d{4}")
mo=phoneRegex.findall(resume)
print(mo)

#+end_src

#+RESULTS:
: ['508-555-5555', '508-555-1234']

We used findall() above so we can easily find all of the matches. If we used search() like we did earlier, it would only return the first match.

There is an important distinction between search() and findall(). The search() method returns Match Objects while the findall() method returns a list of strings.

If the regular expression string has 0 or 1 groups, then the findall() method will jstu return a list of strings which each string in the list is the text that was found.


However, with regex objects that have 2 or more groups, the following occurs.

#+begin_src python :results output :exports both

import re

resume="""
JESSE KENDALL
123 Elm Street, Fall River, MA 02723, Cell: 508-555-5555, Home: 508-555-1234 twemel@charter.net



SUMMARY OF QUALIFICATIONS
Dedicated cell phone sales professional with demonstrated success in retail management, product presentation, and customer service. Proven ability to assess client needs; establish rapport, build trust, and close deals. Meet and exceed sales objectives and challenging goals. Proficient in Microsoft Office (Word, Excel, PowerPoint, Access), and H/O billing systems.

SALES SUCCESS
RETAIL STORE SALES MANAGER, 20xx – 20xx
ABC CELLULAR, Fall River, MA
Recruited, hired, trained, developed, and directed retail sales teams for two retail ABC Wireless dealer stores. Oversaw client relations, new account development, and customer service. Supervised administrative functions, inventory, cash flow, merchandising, and operations. Conducted ongoing staff development and personal growth planning for employees.

Implemented a sales-tracking spreadsheet to replace a manual form writing process to increase efficiency.
Developed innovative and effective marketing programs; exceeded store sales quotas.
Successfully managed one of the highest-producing ABC Wireless dealer locations in the San Diego market.
Received several “Sales Manager of the Month” Awards.
Created a team spirit within the stores that resulted in increased sales, long-term employees, and customer satisfaction.
CELL PHONE SALES REPRESENTATIVE, 20xx – 20xx
BCD CELL PHONE HUT, Fall River, MA
Partnered with a high-performing sales staff to provided quality customer service. Served as a customer advocate; interfaced with the clients’ designated program administrators to provide product and service solutions and meet individual customer needs. Assisted customers with billing and expense management, post sale customer education on wireless service and equipment, issue resolution, and technical troubleshooting.

Effectively delivered post-sale care services, exceeding clients’ expectations in a cost-effective manner.
Obtained significant business by delivering presale presentations to demonstrate new phone features.
CUSTOMER SERVICE REPRESENTATIVE, 20xx – 20xx
CDE CELLULAR SERVICES, Fall River, MA
Responded to billing inquiries, assisted in technical troubleshooting, and performed rate plan analysis. Provided friendly and professional customer service while answering over 90 inbound calls per day.

Chosen to facilitate training in an outsourced call center.
EDUCATION
Bachelor of Arts in Communication (Major: Advertising), 20xx
XYZ UNIVERSITY, Milwaukee, WI

REFERENCES
Excellent references provided upon request.
"""


phoneRegex=re.compile(r"(\d{3})-(\d{3}-\d{4})")
mo=phoneRegex.findall(resume)
print(mo)

#+end_src

#+RESULTS:
: [('508', '555-5555'), ('508', '555-1234')]

Now, instead of returning a list of strings, a list of tuples containing strings is returned. Each string in the tuple is the contents of each group.

