Section 10: Regular Expressions/Section 10.org
** Character Classes

We've already looked at one character class (\d). It represents any numeric digit between 0 and 9. Character classes are shortcuts that make our code easier to read and write.

| Shorthand character class | Represents                                                                                             |
|---------------------------+--------------------------------------------------------------------------------------------------------|
| \d                        | Any numeric digit from 0 to 9.                                                                         |
| \D                        | Any character that is not a numeric digit from 0 to 9.                                                 |
| \w                        | Any letter, numeric digit, or the underscore character. (Think of this as matching “word” characters.) |
| \W                        | Any character that is not a letter, numeric digit, or the underscore character.                        |
| \s                        | Any space, tab, or newline character. (Think of this as matching “space” characters.)                  |
| \S                        | Any character that is not a space, tab, or newline.                                                    |

** 12 Days of Christmas Example

We can use regular expressions to find patterns where we have some number followed by some words.

#+begin_src python :results output :exports both

import re

lyrics= "12 drummers drumming, 11 pipers piping, 10 lords a leaping, 9 ladies dancing,  maids a milking, 7 swans a swimming, 6 geese a laying, 5 golden rings, 4 calling birds, 3 french hens, 2 turtle doves, and 1 partridge in a pear tree."

xmasRegex=re.compile(r"\d+\s\w+")

print(xmasRegex.findall(lyrics))

#+end_src

#+RESULTS:
: ['12 drummers', '11 pipers', '10 lords', '9 ladies', '7 swans', '6 geese', '5 golden', '4 calling', '3 french', '2 turtle', '1 partridge']

** Making Your Own Character Classes

Above we showed the existing shorthand character classes, but we can create our own character classes as well. Let's say we want to create a shorthand for vowels, then we can use r"[aeiouAEIOU]" for our Regex. If we want to make a negative character class, we can put in a ^ at the start of the square brackets.

#+begin_src python :results output :exports both

import re
vowelRegex=re.compile(r"[aeiouAEIOU]")

print(vowelRegex.findall("Robocop eats baby food."))

doublevowelRegex=re.compile(r"[aeiouAEIOU]{2}")

print(doublevowelRegex.findall("Robocop eats baby food."))

consonantsRegex=re.compile(r"[^aeiouAEIOU]")

print(consonantsRegex.findall("Robocop eats baby food."))
#+end_src

#+RESULTS:
: ['o', 'o', 'o', 'e', 'a', 'a', 'o', 'o']
: ['ea', 'oo']
: ['R', 'b', 'c', 'p', ' ', 't', 's', ' ', 'b', 'b', 'y', ' ', 'f', 'd', '.']
