Section 10: Regular Expressions/Section 10.md


<a id="org117cd28"></a>

## Character Classes

We&rsquo;ve already looked at one character class (\d). It represents any numeric digit between 0 and 9. Character classes are shortcuts that make our code easier to read and write.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shorthand character class</th>
<th scope="col" class="org-left">Represents</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">\d</td>
<td class="org-left">Any numeric digit from 0 to 9.</td>
</tr>


<tr>
<td class="org-left">\D</td>
<td class="org-left">Any character that is not a numeric digit from 0 to 9.</td>
</tr>


<tr>
<td class="org-left">\w</td>
<td class="org-left">Any letter, numeric digit, or the underscore character. (Think of this as matching “word” characters.)</td>
</tr>


<tr>
<td class="org-left">\W</td>
<td class="org-left">Any character that is not a letter, numeric digit, or the underscore character.</td>
</tr>


<tr>
<td class="org-left">\s</td>
<td class="org-left">Any space, tab, or newline character. (Think of this as matching “space” characters.)</td>
</tr>


<tr>
<td class="org-left">&sect;</td>
<td class="org-left">Any character that is not a space, tab, or newline.</td>
</tr>
</tbody>
</table>


<a id="orga4c0df5"></a>

## 12 Days of Christmas Example

We can use regular expressions to find patterns where we have some number followed by some words.

    
    import re
    
    lyrics= "12 drummers drumming, 11 pipers piping, 10 lords a leaping, 9 ladies dancing,  maids a milking, 7 swans a swimming, 6 geese a laying, 5 golden rings, 4 calling birds, 3 french hens, 2 turtle doves, and 1 partridge in a pear tree."
    
    xmasRegex=re.compile(r"\d+\s\w+")
    
    print(xmasRegex.findall(lyrics))

    ['12 drummers', '11 pipers', '10 lords', '9 ladies', '7 swans', '6 geese', '5 golden', '4 calling', '3 french', '2 turtle', '1 partridge']


<a id="org76f6f59"></a>

## Making Your Own Character Classes

Above we showed the existing shorthand character classes, but we can create our own character classes as well. Let&rsquo;s say we want to create a shorthand for vowels, then we can use r&ldquo;[aeiouAEIOU]&rdquo; for our Regex. If we want to make a negative character class, we can put in a ^ at the start of the square brackets.

    
    import re
    vowelRegex=re.compile(r"[aeiouAEIOU]")
    
    print(vowelRegex.findall("Robocop eats baby food."))
    
    doublevowelRegex=re.compile(r"[aeiouAEIOU]{2}")
    
    print(doublevowelRegex.findall("Robocop eats baby food."))
    
    consonantsRegex=re.compile(r"[^aeiouAEIOU]")
    
    print(consonantsRegex.findall("Robocop eats baby food."))

    ['o', 'o', 'o', 'e', 'a', 'a', 'o', 'o']
    ['ea', 'oo']
    ['R', 'b', 'c', 'p', ' ', 't', 's', ' ', 'b', 'b', 'y', ' ', 'f', 'd', '.']

